MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F04KL101/mcu.h
extern volatile T3CONBITS T3CONbits __attribute__((__sfr__));

#define CCP1CON CCP1CON
extern volatile uint16_t CCP1CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
      uint16_t PM:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
      uint16_t PM0:1;
      uint16_t PM1:1;
    };
    struct {
      uint16_t CCP1M:4;
      uint16_t DC1B:2;
      uint16_t P1M:2;
    };
    struct {
      uint16_t CCP1M0:1;
      uint16_t CCP1M1:1;
      uint16_t CCP1M2:1;
      uint16_t CCP1M3:1;
      uint16_t DC1B0:1;
      uint16_t DC1B1:1;
      uint16_t P1M0:1;
      uint16_t P1M1:1;
    };
  };
} CCP1CONBITS;
extern volatile CCP1CONBITS CCP1CONbits __attribute__((__sfr__));

#define ECCP1CON ECCP1CON
extern volatile uint16_t ECCP1CON __attribute__((__sfr__));
__extension__ typedef struct tagECCP1CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
      uint16_t PM:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
      uint16_t PM0:1;
      uint16_t PM1:1;
    };
    struct {
      uint16_t CCP1M:4;
      uint16_t DC1B:2;
      uint16_t P1M:2;
    };
    struct {
      uint16_t CCP1M0:1;
      uint16_t CCP1M1:1;
      uint16_t CCP1M2:1;
      uint16_t CCP1M3:1;
      uint16_t DC1B0:1;
      uint16_t DC1B1:1;
      uint16_t P1M0:1;
      uint16_t P1M1:1;
    };
  };
} ECCP1CONBITS;
extern volatile ECCP1CONBITS ECCP1CONbits __attribute__((__sfr__));

#define CCPR1L CCPR1L
extern volatile uint8_t CCPR1L __attribute__((__sfr__));
#define CCPR1H CCPR1H
extern volatile uint8_t CCPR1H __attribute__((__sfr__));
#define CCP2CON CCP2CON
extern volatile uint16_t CCP2CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP2CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
    };
    struct {
      uint16_t CCP2M:4;
      uint16_t DC2B:2;
    };
    struct {
      uint16_t CCP2M0:1;
      uint16_t CCP2M1:1;
      uint16_t CCP2M2:1;
      uint16_t CCP2M3:1;
      uint16_t DC2B0:1;
      uint16_t DC2B1:1;
    };
  };
} CCP2CONBITS;
extern volatile CCP2CONBITS CCP2CONbits __attribute__((__sfr__));

#define CCPR2L CCPR2L
extern volatile uint8_t CCPR2L __attribute__((__sfr__));
#define CCPR2H CCPR2H
extern volatile uint8_t CCPR2H __attribute__((__sfr__));
#define SPI1BUF SPI1BUF
extern volatile uint16_t SPI1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SPI1BUFBITS;
extern volatile SPI1BUFBITS SPI1BUFbits __attribute__((__sfr__));

#define SSP1BUF SSP1BUF
extern volatile uint16_t SSP1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSSP1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SSP1BUFBITS;
extern volatile SSP1BUFBITS SSP1BUFbits __attribute__((__sfr__));

#define SSP1CON1 SSP1CON1
extern volatile uint16_t SSP1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON1BITS {
  union {
    struct {
      uint16_t SSPM:4;
      uint16_t CKP:1;
      uint16_t SSPEN:1;
      uint16_t SSPOV:1;
      uint16_t WCOL:1;
    };
    struct {
      uint16_t SSPM0:1;
      uint16_t SSPM1:1;
      uint16_t SSPM2:1;
      uint16_t SSPM3:1;
    };
  };
} SSP1CON1BITS;
extern volatile SSP1CON1BITS SSP1CON1bits __attribute__((__sfr__));

#define SSP1CON2 SSP1CON2
extern volatile uint16_t SSP1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON2BITS {
  union {
    struct {
      uint16_t SEN:1;
      uint16_t RSEN:1;
      uint16_t PEN:1;
      uint16_t RCEN:1;
      uint16_t ACKEN:1;
      uint16_t ACKDT:1;
      uint16_t ACKSTAT:1;
      uint16_t GCEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK:5;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK1:1;
      uint16_t ADMSK2:1;
      uint16_t ADMSK3:1;
      uint16_t ADMSK4:1;
      uint16_t ADMSK5:1;
    };
  };
} SSP1CON2BITS;
extern volatile SSP1CON2BITS SSP1CON2bits __attribute__((__sfr__));

#define SSP1CON3 SSP1CON3
extern volatile uint16_t SSP1CON3 __attribute__((__sfr__));
typedef struct tagSSP1CON3BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
  uint16_t ACKTIM:1;
} SSP1CON3BITS;
extern volatile SSP1CON3BITS SSP1CON3bits __attribute__((__sfr__));

#define SSP1STAT SSP1STAT
extern volatile uint16_t SSP1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSSP1STATBITS {
  union {
    struct {
      uint16_t BF:1;
      uint16_t UA:1;
      uint16_t R_NOT_W:1;
      uint16_t S:1;
      uint16_t P:1;
      uint16_t D_NOT_A:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
    };
    struct {
      uint16_t :2;
      uint16_t R_W:1;
      uint16_t :2;
      uint16_t D_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_W:1;
      uint16_t :2;
      uint16_t NOT_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_WRITE:1;
      uint16_t :2;
      uint16_t NOT_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t READ_WRITE:1;
      uint16_t :2;
      uint16_t DATA_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t I2C_READ:1;
      uint16_t I2C_START:1;
      uint16_t I2C_STOP:1;
      uint16_t I2C_DAT:1;
    };
  };
} SSP1STATBITS;
extern volatile SSP1STATBITS SSP1STATbits __attribute__((__sfr__));

#define I2C1ADD I2C1ADD
extern volatile uint16_t I2C1ADD __attribute__((__sfr__));
__extension__ typedef struct tagI2C1ADDBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} I2C1ADDBITS;
