MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F04KL101/mcu.h
#define _INTTREG_VECNUM4_POSITION                0x00000004
#define _INTTREG_VECNUM4_MASK                    0x00000010
#define _INTTREG_VECNUM4_LENGTH                  0x00000001

#define _INTTREG_VECNUM5_POSITION                0x00000005
#define _INTTREG_VECNUM5_MASK                    0x00000020
#define _INTTREG_VECNUM5_LENGTH                  0x00000001

#define _INTTREG_VECNUM6_POSITION                0x00000006
#define _INTTREG_VECNUM6_MASK                    0x00000040
#define _INTTREG_VECNUM6_LENGTH                  0x00000001

#define _INTTREG_ILR0_POSITION                   0x00000008
#define _INTTREG_ILR0_MASK                       0x00000100
#define _INTTREG_ILR0_LENGTH                     0x00000001

#define _INTTREG_ILR1_POSITION                   0x00000009
#define _INTTREG_ILR1_MASK                       0x00000200
#define _INTTREG_ILR1_LENGTH                     0x00000001

#define _INTTREG_ILR2_POSITION                   0x0000000A
#define _INTTREG_ILR2_MASK                       0x00000400
#define _INTTREG_ILR2_LENGTH                     0x00000001

#define _INTTREG_ILR3_POSITION                   0x0000000B
#define _INTTREG_ILR3_MASK                       0x00000800
#define _INTTREG_ILR3_LENGTH                     0x00000001

#define _T1CON_TCS_POSITION                      0x00000001
#define _T1CON_TCS_MASK                          0x00000002
#define _T1CON_TCS_LENGTH                        0x00000001

#define _T1CON_TSYNC_POSITION                    0x00000002
#define _T1CON_TSYNC_MASK                        0x00000004
#define _T1CON_TSYNC_LENGTH                      0x00000001

#define _T1CON_TCKPS_POSITION                    0x00000004
#define _T1CON_TCKPS_MASK                        0x00000030
#define _T1CON_TCKPS_LENGTH                      0x00000002

#define _T1CON_TGATE_POSITION                    0x00000006
#define _T1CON_TGATE_MASK                        0x00000040
#define _T1CON_TGATE_LENGTH                      0x00000001

#define _T1CON_TECS_POSITION                     0x00000008
#define _T1CON_TECS_MASK                         0x00000300
#define _T1CON_TECS_LENGTH                       0x00000002

#define _T1CON_TSIDL_POSITION                    0x0000000D
#define _T1CON_TSIDL_MASK                        0x00002000
#define _T1CON_TSIDL_LENGTH                      0x00000001

#define _T1CON_TON_POSITION                      0x0000000F
#define _T1CON_TON_MASK                          0x00008000
#define _T1CON_TON_LENGTH                        0x00000001

#define _T1CON_TCKPS0_POSITION                   0x00000004
#define _T1CON_TCKPS0_MASK                       0x00000010
#define _T1CON_TCKPS0_LENGTH                     0x00000001

#define _T1CON_TCKPS1_POSITION                   0x00000005
#define _T1CON_TCKPS1_MASK                       0x00000020
#define _T1CON_TCKPS1_LENGTH                     0x00000001

#define _T1CON_TECS0_POSITION                    0x00000008
#define _T1CON_TECS0_MASK                        0x00000100
#define _T1CON_TECS0_LENGTH                      0x00000001

#define _T1CON_TECS1_POSITION                    0x00000009
#define _T1CON_TECS1_MASK                        0x00000200
#define _T1CON_TECS1_LENGTH                      0x00000001

#define _T1CON_T1ECS_POSITION                    0x00000008
#define _T1CON_T1ECS_MASK                        0x00000300
#define _T1CON_T1ECS_LENGTH                      0x00000002

#define _T1CON_T1ECS0_POSITION                   0x00000008
#define _T1CON_T1ECS0_MASK                       0x00000100
#define _T1CON_T1ECS0_LENGTH                     0x00000001

#define _T1CON_T1ECS1_POSITION                   0x00000009
#define _T1CON_T1ECS1_MASK                       0x00000200
#define _T1CON_T1ECS1_LENGTH                     0x00000001

#define _T2CON_T2CKPS_POSITION                   0x00000000
#define _T2CON_T2CKPS_MASK                       0x00000003
#define _T2CON_T2CKPS_LENGTH                     0x00000002

#define _T2CON_TMR2ON_POSITION                   0x00000002
#define _T2CON_TMR2ON_MASK                       0x00000004
#define _T2CON_TMR2ON_LENGTH                     0x00000001

#define _T2CON_T2OUTPS_POSITION                  0x00000003
#define _T2CON_T2OUTPS_MASK                      0x00000078
#define _T2CON_T2OUTPS_LENGTH                    0x00000004

#define _T2CON_TCKPS_POSITION                    0x00000000
#define _T2CON_TCKPS_MASK                        0x00000003
#define _T2CON_TCKPS_LENGTH                      0x00000002

#define _T2CON_TON_POSITION                      0x00000002
#define _T2CON_TON_MASK                          0x00000004
#define _T2CON_TON_LENGTH                        0x00000001

#define _T2CON_TOUTPS_POSITION                   0x00000003
#define _T2CON_TOUTPS_MASK                       0x00000078
#define _T2CON_TOUTPS_LENGTH                     0x00000004

#define _T2CON_T2CKPS0_POSITION                  0x00000000
#define _T2CON_T2CKPS0_MASK                      0x00000001
#define _T2CON_T2CKPS0_LENGTH                    0x00000001

#define _T2CON_T2CKPS1_POSITION                  0x00000001
#define _T2CON_T2CKPS1_MASK                      0x00000002
#define _T2CON_T2CKPS1_LENGTH                    0x00000001

#define _T2CON_T2OUTPS0_POSITION                 0x00000003
#define _T2CON_T2OUTPS0_MASK                     0x00000008
#define _T2CON_T2OUTPS0_LENGTH                   0x00000001

#define _T2CON_T2OUTPS1_POSITION                 0x00000004
#define _T2CON_T2OUTPS1_MASK                     0x00000010
#define _T2CON_T2OUTPS1_LENGTH                   0x00000001

#define _T2CON_T2OUTPS2_POSITION                 0x00000005
#define _T2CON_T2OUTPS2_MASK                     0x00000020
#define _T2CON_T2OUTPS2_LENGTH                   0x00000001

#define _T2CON_T2OUTPS3_POSITION                 0x00000006
#define _T2CON_T2OUTPS3_MASK                     0x00000040
#define _T2CON_T2OUTPS3_LENGTH                   0x00000001

#define _T3GCON_T3GSS_POSITION                   0x00000000
#define _T3GCON_T3GSS_MASK                       0x00000003
#define _T3GCON_T3GSS_LENGTH                     0x00000002

#define _T3GCON_T3GVAL_POSITION                  0x00000002
#define _T3GCON_T3GVAL_MASK                      0x00000004
#define _T3GCON_T3GVAL_LENGTH                    0x00000001

#define _T3GCON_T3GGO_POSITION                   0x00000003
#define _T3GCON_T3GGO_MASK                       0x00000008
#define _T3GCON_T3GGO_LENGTH                     0x00000001

#define _T3GCON_T3GSPM_POSITION                  0x00000004
#define _T3GCON_T3GSPM_MASK                      0x00000010
#define _T3GCON_T3GSPM_LENGTH                    0x00000001

#define _T3GCON_T3GTM_POSITION                   0x00000005
#define _T3GCON_T3GTM_MASK                       0x00000020
#define _T3GCON_T3GTM_LENGTH                     0x00000001

#define _T3GCON_T3GPOL_POSITION                  0x00000006
#define _T3GCON_T3GPOL_MASK                      0x00000040
#define _T3GCON_T3GPOL_LENGTH                    0x00000001

